tap "coursier/formulas"
tap "drone/drone"
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/gui"
tap "homebrew/services"
tap "homebrew/versions"
tap "homebrew/x11"
tap "neovim/neovim"
tap "olafurpg/scalafmt"
tap "rogual/neovim-dot-app"
cask "xquartz"
brew "libffi"
brew "libcroco"
brew "librsvg"
brew "adwaita-icon-theme"
brew "docbook"
brew "asciidoc"
brew "autoenv"
brew "automake"
brew "avro-tools"
brew "gdbm"
brew "openssl"
brew "readline"
brew "sqlite"
brew "python"
brew "awscli"
brew "bfg"
brew "binutils"
brew "gmp"
brew "isl"
brew "p7zip"
brew "ssdeep"
brew "binwalk"
brew "bison"
brew "boost", args: ["with-icu4c"]
brew "brew-cask-completion"
brew "bundler-completion"
brew "cabextract"
brew "cargo-completion"
brew "ccache"
brew "check"
brew "chruby"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cpanminus"
brew "ctags"
brew "curl"
brew "datamash"
brew "dbus"
brew "dcd"
brew "ddrescue"
brew "go"
brew "dep"
brew "diff-so-fancy"
brew "libgpg-error"
brew "libassuan"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "dmd"
brew "docbook-xsl"
brew "docker"
brew "libyaml"
brew "docker-compose"
brew "dos2unix"
brew "doxygen"
brew "drip"
brew "unrar"
brew "dtrx"
brew "pkg-config"
brew "dub"
brew "elasticsearch"
brew "entr"
brew "exiftool"
brew "lame"
brew "libogg"
brew "x264"
brew "xvid"
brew "ffmpeg", args: ["with-libvorbis", "with-openssl", "with-speex", "with-theora", "with-tools", "with-x265"]
brew "findutils"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc@6"
brew "gcore"
brew "gd"
brew "gdb", args: ["with-python"]
brew "geoip", args: ["with-geoipupdate"]
brew "geoipupdate"
brew "gist"
brew "git"
brew "python@2"
brew "qt"
brew "pyqt"
brew "git-cola"
brew "git-extras"
brew "libunistring"
brew "nettle"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "libsigc++"
brew "glibmm"
brew "glide"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "libusb"
brew "pinentry"
brew "gnuplot", args: ["with-cairo"]
brew "gpg-agent"
brew "gpgme"
brew "gpm"
brew "gradle"
brew "jasper"
brew "graphicsmagick", args: ["with-perl", "with-webp"]
brew "graphviz", args: ["with-app", "with-freetype", "with-librsvg"]
brew "grep"
brew "gron"
brew "gsasl"
brew "libepoxy"
brew "gtk+3"
brew "source-highlight"
brew "gtk-doc"
brew "gtksourceview3"
brew "gzip"
brew "heroku"
brew "hexcurse"
brew "hexedit"
brew "htop", args: ["with-ncurses"]
brew "ipcalc"
brew "ivy"
brew "oniguruma"
brew "jq"
brew "jsoncpp"
brew "jython"
brew "librdkafka"
brew "kafkacat"
brew "kibana"
brew "launchctl-completion"
brew "ldc"
brew "libevent"
brew "libusb-compat"
brew "libgphoto2"
brew "libicns"
brew "libmxml"
brew "libotr"
brew "libsodium"
brew "vala"
brew "libsoup"
brew "libstrophe"
brew "libvorbis"
brew "libxml++"
brew "libxml++3"
brew "libxslt"
brew "links"
brew "little-cms2"
brew "logstash"
brew "luarocks"
brew "lzo"
brew "lzop"
brew "makedepend"
brew "markdown"
brew "maven"
brew "maven-completion"
brew "md5deep"
brew "mercurial"
brew "moreutils", args: ["without-parallel"]
brew "mupdf"
brew "neovim"
brew "net-snmp"
brew "netcat"
brew "ninja"
brew "nmap", args: ["with-pygtk"]
brew "openblas", args: ["with-openmp"]
brew "openssh"
brew "ossp-uuid"
brew "par2"
brew "parallel"
brew "pcre++"
brew "pigz"
brew "pinentry-mac"
brew "pip-completion"
brew "pngcrush"
brew "postgresql", args: ["with-python"]
brew "terminal-notifier"
brew "profanity"
brew "progress"
brew "pstree"
brew "pv", args: ["with-gettext"]
brew "pxz"
brew "pygobject3"
brew "pypy"
brew "pypy3"
brew "r", args: ["with-java"]
brew "rbenv"
brew "recode"
brew "redis"
brew "rename"
brew "rpm"
brew "rsync"
brew "ruby-install"
brew "rustc-completion"
brew "rustup-init"
brew "zeromq"
brew "salt"
brew "sane-backends"
brew "sbt"
brew "scala"
brew "snappy"
brew "ssh-copy-id"
brew "ssllabs-scan"
brew "sslscan"
brew "sslyze"
brew "sysdig"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "typesafe-activator"
brew "utf8proc"
brew "v8"
brew "vim", args: ["with-luajit", "with-tcl"]
brew "yara"
brew "volatility"
brew "vte"
brew "watch"
brew "wget", args: ["with-pcre"]
brew "wine"
brew "winetricks"
brew "wxmac"
brew "wxpython"
brew "xml2"
brew "xmlto"
brew "xsv"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier", args: ["HEAD"]
cask "chefdk"
cask "db-browser-for-sqlite"
cask "dbvisualizer"
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-source-code-pro-for-powerline"
cask "jad"
cask "kdiff3"
cask "macvim"
cask "meld"
cask "minikube"
cask "td-agent"
cask "vimr"
