cask "xquartz"
brew "autoenv"
brew "automake"
brew "openssl"
brew "readline"
brew "sqlite"
brew "python"
brew "awscli"
brew "bfg"
brew "binutils"
brew "gmp"
brew "p7zip"
brew "ssdeep"
brew "binwalk"
brew "bison"
brew "boost", args: ["with-icu4c"]
brew "brew-cask-completion"
brew "bundler-completion"
brew "cabextract"
brew "cargo-completion"
brew "ccache"
brew "chruby"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cpanminus"
brew "ctags"
brew "curl"
brew "ddrescue"
brew "go"
brew "dep"
brew "docker"
brew "libyaml"
brew "docker-compose"
brew "dos2unix"
brew "drip"
brew "unrar"
brew "dtrx"
brew "pkg-config"
brew "entr"
brew "exiftool"
brew "ffmpeg", args: ["with-libvorbis", "with-openssl", "with-speex", "with-theora", "with-tools", "with-x265"]
brew "findutils"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gdb", args: ["with-python"]
brew "geoip", args: ["with-geoipupdate"]
brew "geoipupdate"
brew "gist"
brew "git"
brew "python@2"
brew "qt"
brew "pyqt"
brew "git-cola"
brew "git-extras"
brew "glide"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "libusb"
brew "pinentry"
brew "gnuplot", args: ["with-cairo"]
brew "gpg-agent"
brew "gpm"
brew "gradle"
brew "graphicsmagick", args: ["with-perl", "with-webp"]
brew "graphviz", args: ["with-app", "with-freetype", "with-librsvg"]
brew "grep"
brew "gtk+3"
brew "source-highlight"
brew "gzip"
brew "heroku"
brew "hexcurse"
brew "hexedit"
brew "htop", args: ["with-ncurses"]
brew "ipcalc"
brew "ivy"
brew "jq"
brew "kafkacat"
brew "launchctl-completion"
brew "libevent"
brew "libmxml"
brew "libsodium"
brew "libsoup"
brew "libxml++"
brew "libxml++3"
brew "links"
brew "logstash"
brew "luarocks"
brew "lzo"
brew "lzop"
brew "makedepend"
brew "markdown"
brew "maven"
brew "maven-completion"
brew "md5deep"
brew "mercurial"
brew "moreutils", args: ["without-parallel"]
brew "neovim"
brew "netcat"
brew "ninja"
brew "nmap", args: ["with-pygtk"]
brew "openblas", args: ["with-openmp"]
brew "openssh"
brew "ossp-uuid"
brew "par2"
brew "parallel"
brew "pcre++"
brew "pigz"
brew "pinentry-mac"
brew "pip-completion"
brew "pngcrush"
brew "postgresql", args: ["with-python"]
brew "terminal-notifier"
brew "profanity"
brew "progress"
brew "pstree"
brew "pv", args: ["with-gettext"]
brew "pxz"
brew "pypy"
brew "pypy3"
brew "r", args: ["with-java"]
brew "rbenv"
brew "recode"
brew "redis"
brew "rename"
brew "rpm"
brew "rsync"
brew "rustc-completion"
brew "rustup-init"
brew "zeromq"
brew "salt"
brew "sbt"
brew "scala"
brew "snappy"
brew "ssh-copy-id"
brew "ssllabs-scan"
brew "sslscan"
brew "sslyze"
brew "sysdig"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "typesafe-activator"
brew "utf8proc"
brew "vim", args: ["with-luajit", "with-tcl"]
brew "yara"
brew "volatility"
brew "vte"
brew "watch"
brew "wget", args: ["with-pcre"]
brew "wine"
brew "winetricks"
brew "wxpython"
brew "xml2"
brew "xmlto"
brew "xsv"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier", args: ["HEAD"]
cask "docker"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-source-code-pro-for-powerline"
cask "jad"
cask "kdiff3"
cask "macvim"
cask "meld"
cask "vimr"
