tap "cjbassi/gotop"
tap "drone/drone"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "olafurpg/scalafmt"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Per-project, per-directory shell environments
brew "autoenv"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# GNU multiple precision arithmetic library
brew "gmp"
# SSL/TLS cryptography library
brew "openssl"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Recursive piecewise hashing tool
brew "ssdeep"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Bash completion for Bundler
brew "bundler-completion"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Real-time data compression library
brew "lzo"
# Bash and Zsh completion for Cargo
brew "cargo-completion"
# Object-file caching compiler wrapper
brew "ccache"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNU data recovery tool
brew "ddrescue"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# YAML Parser
brew "libyaml"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# JVM launching without the hassle of persistent JVMs
brew "drip"
# Extract, view, and test RAR archives
brew "unrar"
# Intelligent archive extraction
brew "dtrx"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Convert video files to Ogg Theora format
brew "ffmpeg2theora"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Automatic updates of GeoIP2 and GeoIP Legacy databases
brew "geoipupdate"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Cross-platform application and UI framework
brew "qt"
# Highly caffeinated git GUI
brew "git-cola"
# Small git utilities
brew "git-extras"
# Generate files and directories from templates in a git repo
brew "giter8"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# Library for USB device access
brew "libusb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Command-driven, interactive function plotting
brew "gnuplot"
# Go programming environment (1.12)
brew "go@1.12"
# Barebones dependency manager for Go
brew "gpm"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image processing tools collection
brew "graphicsmagick"
# GNU grep, egrep and fgrep
brew "grep"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Popular GNU data compression program
brew "gzip"
# Ncurses-based console hex editor
brew "hexcurse"
# View and edit files in hexadecimal or ASCII
brew "hexedit"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Agile dependency manager
brew "ivy"
# Command-line interface for Jfrog Artifactory and Bintray
brew "jfrog-cli-go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
# Bash completion for Launchctl
brew "launchctl-completion"
# Mini-XML library
brew "libmxml"
# NaCl networking and cryptography library
brew "libsodium"
# HTTP client/server library for GNOME
brew "libsoup"
# C++ wrapper for libxml
brew "libxml++"
# C++ wrapper for libxml
brew "libxml++3"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Tool for managing events and logs
brew "logstash"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Package manager for the Lua programming language
brew "luarocks"
# File compressor
brew "lzop"
# Creates dependencies in makefiles
brew "makedepend"
# Text-to-HTML conversion tool
brew "markdown"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Recursively compute digests on files/directories
brew "md5deep"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Scalable distributed version control system
brew "mercurial"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils", link: false
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Parchive: Parity Archive Volume Set for data recovery
brew "par2"
# Shell command parallelization utility
brew "parallel", link: false
# C++ wrapper for the Perl Compatible Regular Expressions
brew "pcre++"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Bash completion for Pip
brew "pip-completion"
# Python dependency management tool
brew "pipenv"
# Optimizer for PNG files
brew "pngcrush"
# Object-relational database system
brew "postgresql"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Console based XMPP client
brew "profanity"
# Progress: Coreutils Progress Viewer
brew "progress"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Highly performant implementation of Python 2 in Python
brew "pypy"
# Implementation of Python 3 in Python
brew "pypy3"
# Official Python bindings for Qt
brew "pyside"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Convert character set (charsets)
brew "recode"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Standard unix software packaging tool
brew "rpm"
# Utility that provides fast incremental file transfer
brew "rsync"
# Bash completion for rustc
brew "rustc-completion"
# The Rust toolchain installer
brew "rustup-init"
# High-performance, asynchronous messaging library
brew "zeromq"
# Dynamic infrastructure communication bus
brew "salt"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Source-code syntax highlighter
brew "source-highlight"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# This tool is a command-line client for the SSL Labs APIs
brew "ssllabs-scan"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# SSL scanner
brew "sslyze"
# System-level exploration and troubleshooting tool
brew "sysdig"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for working with Lightbend Reactive Platform
brew "typesafe-activator"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Vi 'workalike' with many additional features
brew "vim"
# Malware identification and classification tool
brew "yara"
# Advanced memory forensics framework
brew "volatility"
# Terminal emulator widget used by GNOME terminal
brew "vte"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Download and install various runtime libraries
brew "winetricks"
# Python bindings for wxWidgets
brew "wxpython"
# Makes XML and HTML more amenable to classic UNIX text tools
brew "xml2"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
brew "olafurpg/scalafmt/coursier", args: ["HEAD"]
brew "olafurpg/scalafmt/scalafix", args: ["HEAD"]
brew "olafurpg/scalafmt/scalafmt", args: ["HEAD"]
cask "docker"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font-mono"
cask "font-fontawesome"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-hasklig"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "font-input"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-nerd-font-mono"
cask "font-monoid"
cask "font-monoid-nerd-font"
cask "font-monoid-nerd-font-mono"
cask "font-office-code-pro"
cask "font-powerline-symbols"
cask "font-source-code-pro-for-powerline"
cask "font-victor-mono"
cask "gimp"
cask "jad"
cask "kdiff3"
cask "keepassxc"
cask "meld"
cask "wireshark"
cask "xquartz"
